Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: The compiler can prove that memory safety is preserved because the two stored properties don’t interact in any way.
ja: コンパイラはメモリ安全が守られることを立証できます、なぜなら２つの格納プロパティはどんな方法でも相互作用しないからです。

source: The compiler displays the new name when emitting an error about the use of a renamed declaration.
ja: コンパイラは、ある改名された宣言の使用についてのエラーを発するときにその新しい名前を表示します。

source: The compiler implicitly adds the objc attribute to subclasses of any class defined in Objective-C.
ja: コンパイラは、Objective-Cにおいて定義されたあらゆるクラスのサブクラスに暗黙的にobjc属性を加えます。

source: The compiler is allowed to replace calls to an inlinable symbol with a copy of the symbol’s implementation at the call site.
ja: コンパイラは、インライン可能シンボルへの呼び出しを、呼び出し場所でのそのシンボルの持つ実装のコピーで置き換えます。

source: The compiler is optimized for performance and the language is optimized for development, without compromising on either.
ja: コンパイラはパフォーマンスのために最適化され言語は開発のために最適化されます、どちらについても妥協することなく。

source: The compiler makes this possible using techniques like looking up information at runtime and adding a layer of indirection.
ja: コンパイラは、これを、実行時に情報を検索することそして間接参照のレイヤーを加えることのような技術いくつかを使って可能にします。

source: The compiler synthesizes an identifier for the projected value by prefixing the name of the wrapped property with a dollar sign ($)—for example, the projected value for someProperty is $someProperty.
ja: コンパイラは、ある識別子を予測値に対して合成します、ラップされたプロパティの名前にドル記号（$）で接頭辞をつけることによって — 例えば、somePropertyに対する見込値は$somePropertyです。

source: The compiler synthesizes identifiers that begin with a dollar sign ($) for properties that have a property wrapper projection.
ja: コンパイラは、ドル記号（$）で始まる識別子を、プロパティラッパー予測を持つプロパティに対して合成します。

source: The compiler synthesizes storage for the instance of the wrapper type by prefixing the name of the wrapped property with an underscore (_)—for example, the wrapper for someProperty is stored as _someProperty.
ja: コンパイラは、ラッパー型のインスタンスのためにストレージを合成します、ラップされたプロパティの名前にアンダースコア（_）で接頭辞をつけることによって — 例えば、somePropertyに対するラッパーは、_somePropertyとして格納されます。

source: The compiler uses availability information in the SDK to verify that all of the APIs used in your code are available on the deployment target specified by your project.
ja: コンパイラは、SDKの中の有効性情報を使って、あなたのコードの中で使用されるAPIの全てがあなたのプロジェクトで指定される開発対象で有効であることを確かめます。

source: The compiler uses the information from the availability condition when it verifies that the APIs in that block of code are available.
ja: コンパイラは、有効性条件からの情報を、それがそのブロックの中のAPIが利用可能であることを確かめる時に使います。

source: The compound assignment operators don’t return a value.
ja: 複合代入演算子は、値を返しません。

source: The computed numberOfRooms property simply returns the value of the count property from the rooms array.
ja: 計算numberOfRoomsプロパティは、単にrooms配列からcountプロパティの値を返します。

source: The computed type property examples above are for read-only computed type properties, but you can also define read-write computed type properties with the same syntax as for computed instance properties.
ja: 上の計算型プロパティの例は、読み出し専用の計算型プロパティのためのものです、しかしあなたはまた、計算インスタンスプロパティについては同じ構文をつかって読み書き両用の計算型プロパティを定義することができます。

source: The concept of a stack is used by the UINavigationController class to model the view controllers in its navigation hierarchy.
ja: スタックの概念は、UINavigationControllerクラスで使用されて、そのナビゲーション階層においてビュー・コントローラをモデル化します。

source: The concept of optionals doesn’t exist in C or Objective-C.
ja: オプショナルの概念は、CまたはObjective-Cの中に存在しません。

source: The condition can also be an optional binding declaration, as discussed in Optional Binding.
ja: 条件はまた、オプショナル束縛で議論される、オプショナル束縛宣言であることができます。

source: The condition of a loop can be at the end instead, ensuring that the loop is run at least once.
ja: ループの条件は終わりに置くことができます、その場合にはループが少なくとも一回は実行されることを確実にします。

source: The conditional form, as?, returns an optional value of the type you are trying to downcast to.
ja: 条件（仮定）形式as?は、あなたがダウンキャストしようとしている型のオプショナルの値を返します。

source: The constraint on Item is a generic where clause, which is discussed in Associated Types with a Generic Where Clause below.
ja: Itemでの制約は総称体whereです、それは下のwhere節を持つ関連型において議論されます。

source: The contents of a Dictionary are inherently unordered, and iterating over them does not guarantee the order in which they will be retrieved.
ja: Dictionaryの内容は本質的に順序付けされません、そしてそれらに繰り返すことはそれらが取り出される順番を保証しません。

source: The contents of a String can be accessed in various ways, including as a collection of Character values.
ja: あるStringの内容は、いくつかのやり方でアクセスされることができます、それにはCharacter値からなるひとつのコレクションとしてを含みます。

source: The contents of this expression are also considered when performing type inference on the surrounding expression.
ja: この式の内容はまた、型推論を実行する時に周囲の式上にあると見なされます。

source: The context and function name should make it clear that evaluation is being deferred.
ja: 文脈と関数名は、評価が猶予されていることを明確にしなければなりません。

source: The context in which a type conforms to a particular protocol is the minimum of the type’s access level and the protocol’s access level.
ja: ある型が特定のプロトコルに準拠するところの前後関係は、その型のアクセス水準とプロトコルのアクセス水準の最も低いものです。

source: The convenience initializer must call one of the two designated initializers, because it can only call another initializer from the same class.
ja: 便宜イニシャライザは、２つの指定イニシャライザのうちの１つを呼ぶに違いありません、なぜなら、それが同じクラスから別のイニシャライザを呼ぶことができるだけだからです。

source: The corresponding argument must have no label in function or method calls.
ja: 対応する引数には、関数またはメソッドの呼び出しにおいてラベルがあってはなりません。

source: The corresponding argument must use the given argument label in function or method calls.
ja: 対応する引数は、この引数ラベルを関数またはメソッドの呼び出しにおいて使わなければなりません。

source: The corresponding implementation for Vector2D instances performs this operation on both the x and y properties:
ja: Vector2Dインスタンスのための対応する実装は、xとyプロパティ両方の上でこの操作を実行します：

source: The corresponding section in Strings and Characters has been removed, and various code examples have been updated.
ja: 文字列と文字の中の関連する節は削除されました、そしてさまざまなコード例が更新されました。

source: The count of the characters returned by the count property isn’t always the same as the length property of an NSString that contains the same characters.
ja: countプロパティによって返される文字の総数は、同じ文字を含むNSStringのlengthプロパティと常に同じではありません。

source: The current while loop execution then ends, and the loop’s condition is checked to see if the loop should be executed again.
ja: 現在のwhileループ実行はそれから終了します、そしてループが再び実行されなければならないかどうか見るためにループの条件が調べられます。

source: The current center position of a Rect can always be determined from its origin and size, and so you don’t need to store the center point as an explicit Point value.
ja: Rectの現在の中心位置は常にそのoriginとsizeから決定されることができます、なのであなたは中心点をわざわざPoint値として格納する必要ばありません。

source: The current login attempt counter is declared as a variable, because this value must be incremented after each failed login attempt.
ja: 現在のログイン試行の計数は、この値が失敗したログインの試みそれぞれの後で増加する必要があるので、変数として宣言されます。

source: The current loop execution then ends.
ja: 現在のループ実行はそれで終わりです。

source: The decimal fraction consists of a decimal point (.) followed by a sequence of decimal digits.
ja: 小数部は、小数点（.）に続く一連の10進の桁から成ります。

source: The declaration for number in the example above marks the variable as private, which ensures number is used only in the implementation of TwelveOrLess.
ja: numberに対する宣言は上の例において、変数をprivateとして印します、それはnumberがTwelveOrLessの実装においてのみ使われることを保証します。

source: The declaration has the IBAction, IBSegueAction, IBOutlet, IBDesignable, IBInspectable, NSManaged, or GKInspectable attribute.
ja: その宣言は、IBAction、IBSegueAction、IBOutlet、IBDesignable、IBInspectable、NSManaged、またはGKInspectableを持つ。

source: The declaration is an override in a subclass, and the superclass’s declaration has the objc attribute.
ja: その宣言は、サブクラスの中のオーバーライドである、そしてそのサブクラスの宣言がobjc属性を持つ。

source: The declaration must have the internal access level modifier.
ja: 宣言は、internalアクセス水準修飾子を持たなければなりません。

source: The declaration of SimpleClass doesn’t need any of its methods marked as mutating because methods on a class can always modify the class.
ja: SimpleClassの宣言はそのメソッドのどれも変化させるとして印される必要はありません、なぜならあるクラスに属するメソッドは常にそのクラスを修正できるからです。

source: The declaration of the dynamicallyCall(withArguments:) method must have a single parameter that conforms to the ExpressibleByArrayLiteral [https://developer.apple.com/documentation/swift/expressiblebyarrayliteral] protocol—like [Int] in the example above.
ja: dynamicallyCall(withArguments:)メソッドの宣言は、ExpressibleByArrayLiteral [https://developer.apple.com/documentation/swift/expressiblebyarrayliteral]プロトコルに準拠する単一のパラメータを持たなければいけません — 上の例の[Int]のように。

source: The declaration of the dynamicallyCall(withKeywordArguments:) method must have a single parameter that conforms to the ExpressibleByDictionaryLiteral [https://developer.apple.com/documentation/swift/expressiblebydictionaryliteral] protocol, and the return type can be any type.
ja: dynamicallyCall(withKeywordArguments:)メソッドの宣言は、ある単一のパラメータを持たなければなりません、それはExpressibleByDictionaryLiteral [https://developer.apple.com/documentation/swift/expressiblebydictionaryliteral]プロトコルに準拠するものです、そして戻り型はどんな型でも構いません。

source: The declaration satisfies a requirement from a protocol that has the objc attribute.
ja: その宣言は、objc属性を持つあるプロトコルからの要件を満たす。

source: The declaration that the available attribute applies to is ignored if the attribute specifies a platform or language version that doesn’t match the current target.
ja: available属性を適用される宣言は、その属性が現在の対象と合致しないプラットホームまたは言語バージョンを指定するならば無視されます。

source: The default access level of internal already matches this requirement.
ja: 省略時のアクセス水準である内部は、既にこの要件に合致しています。

source: The default inferred type of a string literal is String.
ja: 初期状態で推論されるリテラル文字列の型は、Stringです。

source: The default initializer (when available) is always a designated initializer for a class, and can be used to create a new Vehicle instance with a numberOfWheels of 0:
ja: 省略時のイニシャライザは（利用可能な場合は）、常にクラスのための指定イニシャライザです、そして0のnumberOfWheelsをもつ新しいVehicleインスタンスを作成するために使用されることができます：

source: The default initializer simply creates a new instance with all of its properties set to their default values.
ja: 省略時のイニシャライザは、単に新しいインスタンスを、そのプロパティの全てをそれらの省略時の値に設定することで作成します。

source: The default memberwise initializer for a structure type is considered private if any of the structure’s stored properties are private.
ja: 構造体型のための省略時のメンバー関連イニシャライザは、その構造体の格納プロパティのいずれかが非公開ならば、非公開であるとみなされます。

source: The default types are Int for integer literals, Double for floating-point literals, String for string literals, and Bool for Boolean literals.
ja: 省略時の型は、整数リテラルのためのInt、浮動小数点リテラルのためのDouble、文字列リテラルのためのString、そしてブールのリテラルのためのBoolです。

source: The default value also makes it easier for you to take advantage of default initializers and initializer inheritance, as described later in this chapter.
ja: 省略時の値はまた、あなたが省略時のイニシャライザとイニシャライザ継承を活用することをより簡単にします、そのことはこの章の後で記述されます。

source: The deferred statements may not contain any code that would transfer control out of the statements, such as a break or a return statement, or by throwing an error.
ja: 延期される文は、制御をその文の外に、例えばbreakやreturn文、またはエラーをスローすることによって移すいかなるコードも含んではいけません。

source: The definition describes what the function does, what it expects to receive, and what it returns when it is done.
ja: 定義は、関数が何をするか、それが何を受け取るのを予想するか、そしてそれが実行し終わったとき、それが何を返すかを記述します。

source: The definition makes it easy for the function to be called unambiguously from elsewhere in your code:
ja: 定義は、関数があなたのコードのどこか他の場所から誤解の余地なく呼び出されることを簡単にします：

source: The definition of SmallNumber includes three initializers—init(), init(wrappedValue:), and init(wrappedValue:maximum:)—which the examples below use to set the wrapped value and the maximum value.
ja: SmallNumberの定義は３つのイニシャライザを含みます — init()、init(wrappedValue:)、そしてinit(wrappedValue:maximum:) — それらは、下の例がラップ値と最大値を設定するのに使用します。

source: The definition of typealias Item = Int turns the abstract type of Item into a concrete type of Int for this implementation of the Container protocol.
ja: 定義typealias Item = Intは、抽象型Itemを具象型Intへと、Containerプロトコルのこの実装のために転向します。

source: The definition of this convenience initializer makes RecipeIngredient instances quicker and more convenient to create, and avoids code duplication when creating several single-quantity RecipeIngredient instances.
ja: この便宜イニシャライザの定義は、RecipeIngredientインスタンスを素早くより便利に作成されるようにします、そして数量１のRecipeIngredientインスタンスをいくつか作成する時にコードの繰り返しを防止します。

source: The deinitializer does not take any parameters and is written without parentheses:
ja: デイニシャライザは、まったくパラメータを取りません、したがって丸括弧なしで書かれます：

source: The designated initializer hands off to a superclass initializer to perform the same task for its own stored properties.
ja: 指定イニシャライザは、そのスーパークラスのイニシャライザに、それ自身の格納プロパティに対して同じ作業を実行するように任せます。

source: The designated initializer makes sure that all of the subclass’s properties have a value, as per safety check 1.
ja: 指定イニシャライザは、安全検査１のように、サブクラスのプロパティの全てが値を持つことを確認します。

source: The designated initializer of a class must initialize all of the class’s declared properties and it must do so before calling any of its superclass’s designated initializers.
ja: あるクラスの指定イニシャライザは、そのクラスの指定するプロパティのすべてを初期化しなければ成りません、そしてそれは何であれそれのスーパークラスの指定イニシャライザを呼ぶ前にそうしなければなりません。

source: The dice is rolled at the start of each loop.
ja: さいころは、各ループの始まりで振られます。

source: The difference between a read and write access is usually obvious: a write access changes the location in memory, but a read access doesn’t.
ja: 読み出しと書き込みアクセスの間の違いは、通常は明白です：書き込みアクセスはメモリ中の位置を変更します、しかし読み出しアクセスはそうしません。

source: The difference between assertions and preconditions is in when they’re checked: Assertions are checked only in debug builds, but preconditions are checked in both debug and production builds.
ja: 表明と前提条件の間の違いは、それらが調べられる時にあります：表明はデバッグビルドにおいてのみ調べられます、しかし前提条件はデバッグおよび製品（プロダクション）ビルドの両方において調べられます。

source: The difference between instantaneous access and long-term access is that it’s possible for other code to run after a long-term access starts but before it ends, which is called overlap.
ja: 即時アクセスと長期アクセスの違いは、ある長期アクセスが開始した後しかしそれが終わる前に他のコードに実行が可能であることです、それはオーバーラップと呼ばれます。

source: The difference between open and public access is described below.
ja: 開放と公開アクセスの間の違いは下で解説されます。

source: The difference between strings and substrings is that, as a performance optimization, a substring can reuse part of the memory that’s used to store the original string, or part of the memory that’s used to store another substring.
ja: 文字列と下位文字列の違いは、性能最適化として、下位文字列はオリジナルの文字列を格納するために使われるメモリについての、または別の下位文字列を格納するために使われるメモリの一部についての再利用ができます。

source: The duration of a memory access is either instantaneous or long-term.
ja: メモリアクセスの期間は、即時か長期のどちらかです。

source: The elements of a tuple can be referred to either by name or by number.
ja: あるタプルの要素たちは、名前または番号で言及されることができます。

source: The elements of an array can be accessed through subscripting by specifying a valid index value in square brackets: someArray[0] refers to the element at index 0, "Alex".
ja: 配列の要素は、角括弧の中に有効なインデックス値を指定することによる添え字指定を通してアクセスされることができます：someArray[0]]は、インデックス0での要素、"Alex"に言及します。

source: The else clause of an if statement can contain another if statement to test more than one condition.
ja: if文のelse節は、複数の条件をテストするために別のif文を含むことができます。

source: The end result is the same, but the default value ties the property’s initialization more closely to its declaration.
ja: 最終的な結果は同じものです、しかし省略時の値は、プロパティの初期化をより密接にその宣言に結び付けます。

source: The end result of calling this alternative version of the method will be exactly the same as for calling the earlier version.
ja: メソッドのこの代替版を呼ぶ最終結果は、以前の版を呼ぶことと正確に同じです。

source: The end result was two completely separate instances that contained the same numeric values.
ja: 最終的な結果は２つの完全に別々のインスタンスです、そしてそれらは同じ数値を含みます。

source: The entire definition of the greeting(for:) function is the greeting message that it returns, which means it can use this shorter form.
ja: greeting(for:)関数の全体の定義は、それが返す挨拶メッセージです、それは、それがこの省略形を使用できるのを意味します。

source: The entire expression c?.property.performAction() has a value of an optional type.
ja: 式c?.property.performAction()の全体がオプショナル型の値を持ちます。

source: The entries in the capture list are initialized when the closure is created.
ja: キャプチャリストの中の登録項目は、クロージャが作成されるときに初期化されます。

source: The enumeration below is a refinement of the earlier CompassPoint enumeration, with string raw values to represent each direction’s name:
ja: 以下の列挙は、前のCompassPoint列挙の改良版で、各方位の名前を表す文字列の生の値を持ちます：

source: The enumeration below is a refinement of the earlier Planet enumeration, with integer raw values to represent each planet’s order from the sun:
ja: 下の列挙は、以前のPlanet列挙の改良で、太陽からの各惑星の順番を表す整数の生の値をもちます：

source: The enumeration cases north, south, east, and west therefore also have an access level of public:
ja: この列挙のケース節north、south、east、そしてwestはしたがってまた公開のアクセス水準を持ちます：

source: The enumeration type is pattern-matched against the enumeration case patterns in the case blocks of the switch statement, as described in Enumeration Case Pattern.
ja: 列挙型は、switch文のケース節ブロックにおいて、列挙ケース節パターンに対してパターンのマッチされます、列挙ケース節パターンで記述されるように。

source: The enumeration’s toggle implementation is marked as mutating, to match the Togglable protocol’s requirements:
ja: 列挙のtoggle実装は、Togglableプロトコルの要件に適合するように、mutatingとして印されます：

source: The error is then caught by the general catch clause.
ja: エラーは、それから一般的なcatch節によってキャッチされます。

source: The error on the last line of the example occurs for several reasons.
ja: この例の最後の行でのエラーは、いくつかの理由で発生します。

source: The error that’s thrown continues to propagate until it’s handled by a catch clause of a do statement.
ja: スローされたエラーは、それがdo文のcatch節によって処理されるまで伝達を続けていきます。

source: The escaped special characters \0 (null character), \\ (backslash), \t (horizontal tab), \n (line feed), \r (carriage return), \" (double quotation mark) and \' (single quotation mark)
ja: エスケープされた特殊文字の\0（ヌル文字）、\\（バックスラッシュ）、\t（水平タブ）、\n（ラインフィード）、\r（キャリッジリターン）、\"（二重引用符）と\'（一重引用符）

source: The exact meaning of “subscript” depends on the context in which it is used.
ja: 「添え字」の正確な意味は、それが使われる前後関係に依存します。

source: The example above also defines a new class called VideoMode, to describe a specific video mode for video display.
ja: 上の例は、また、ビデオ・ディスプレイのために特定のビデオ・モードを記述するために、VideoModeと呼ばれる新しいクラスを定義します。

source: The example above calculates the value of one number to the power of another (in this case, 3 to the power of 10).
ja: 上の例は、ある数を他のもので乗算した値を計算します（この場合、3の10乗）。

source: The example above checks whether the temperature is less than or equal to 32 degrees Fahrenheit (the freezing point of water).
ja: 上の例は、温度が華氏32度（水の氷点）以下かどうか確認します。

source: The example above counts how many cases there are, and the example below uses a for loop to iterate over all the cases.
ja: 上の例は、どのくらい多くのケース節があるか数えます、そして下の例は、forループを使って全てのケース節にわたって反復します。

source: The example above creates a Stack instance to store String values, and pushes three strings onto the stack.
ja: 上の例は、StackインスタンスをつくってString値を格納します、そしてスタック上へ３つの文字列をプッシュします。

source: The example above creates a new Matrix instance with two rows and two columns.
ja: 上の例は、２つの行と２つの列で新しいMatrixインスタンスをつくります。

source: The example above creates a new Rect variable called square.
ja: 上の例は、squareと呼ばれる新しいRect変数をつくります。

source: The example above defines a dictionary called testScores, which contains two key-value pairs that map a String key to an array of Int values.
ja: 上の例はtestScoresと呼ばれる辞書型を定義します、それは、２つの「キーと値」対を含んでいて、それはStringキーをInt値を持つ配列と関連づけます。

source: The example above defines a new prefix operator called +++.
ja: 上の例は、+++と呼ばれる新しい接頭辞演算子を定義します。

source: The example above defines a new structure called Resolution, to describe a pixel-based display resolution.
ja: 上の例は、ピクセルに基づくディスプレイ解像度を記述するために、Resolutionと呼ばれる新しい構造体を定義します。

source: The example above defines a variable called numberOfLegs and initializes it with a dictionary literal containing three key-value pairs.
ja: 上の例は、numberOfLegsと呼ばれる変数を定義して、３つの「キーと値」の対を含んでいる辞書リテラルでそれを初期化します。

source: The example above determines whether a positive or negative step is needed to move a variable called currentValue progressively closer to zero.
ja: 上の例は、currentValueと呼ばれる変数を次第にゼロにより近く動かすために正と負の一歩のどちらが必要とされるかを確定します。

source: The example above implements an == operator to check whether two Vector2D instances have equivalent values.
ja: 上の例は、ある==演算子を実装して、２つのVector2Dインスタンスが同等な値を持つかどうかを調べます。

source: The example above implements the unary minus operator (-a) for Vector2D instances.
ja: 上の例は、Vector2Dインスタンスのための単項マイナス演算子（-a）を実装します。

source: The example above in Accessing Properties Through Optional Chaining attempts to set an address value for john.residence, even though the residence property is nil.
ja: オプショナル連鎖を通してプロパティにアクセスするでの前の例は、あるaddress値をjohn.residenceに対して設定することを試みます、たとえresidenceプロパティがnilであるとしてもです。

source: The example above is shorthand for the code below:
ja: 上の例は、下のコードの短縮形です：

source: The example above shows that calling alsoIncrementByTen is the same as calling incrementByTen.
ja: 上の例は、alsoIncrementByTenを呼び出すことはincrementByTenを呼び出す事と同じであるのを示します。

source: The example above shows that the original values of someInt and anotherInt are modified by the swapTwoInts(_:_:) function, even though they were originally defined outside of the function.
ja: 上の例は、someIntとanotherIntの本来の値が、たとえそれらが元々は関数の外側で定義されたとしても、swapTwoInts(_:_:)関数によって修正されることを示します。

source: The example above shows what happens if it is called with an input value of "Anna", and an input value of "Brian".
ja: 上の例は、それが"Anna"の入力値、そして"Brian"の入力値で呼ばれるならば、何が起こるかについて示します。

source: The example above uses a very simple approach to dice rolling.
ja: 上の例は、さいころ振りに対する非常に単純なアプローチを使います。

source: The example above uses the default initializer for the ShoppingListItem class to create a new instance of the class with initializer syntax, written as ShoppingListItem(), and assigns this new instance to a variable called item.
ja: 上の例は、ShoppingListItemクラスのための省略時のイニシャライザを使って、このクラスの新しいインスタンスを作成します、ShoppingListItem()のように書かれる、イニシャライザ構文の所です、そしてこの新しいインスタンスをitemと呼ばれる変数に代入します。

source: The example also creates an Array instance initialized with an array literal containing the same three strings as the stack.
ja: この例はまた、このスタックと同じ３つの文字列を含む配列リテラルで初期化されるArrayインスタンスをつくります。

source: The example also defines a wishHappyBirthday(to:) function.
ja: 例はまた、wishHappyBirthday(to:)関数を定義します。

source: The example also defines two supporting structures called Size and Point, both of which provide default values of 0.0 for all of their properties:
ja: この例はまた、SizeとPointと呼ばれる２つの支援の構造体を定義します、その両方はそれらのプロパティの全てに0.0の省略時の値を提供します：

source: The example below adds a new mutating method called square to Swift’s Int type, which squares the original value:
ja: 下の例は、squareと呼ばれる新しい変更メソッドをスウィフトのInt型に加えます、それは、もとの値を二乗します：

source: The example below calculates the arithmetic mean (also known as the average) for a list of numbers of any length:
ja: 下の例は、どんな長さの数のリストに対しても、算術平均（また平均としても知られるもの）を計算します：

source: The example below calls the Address class’s buildingIdentifier() method through optional chaining.
ja: 下の例は、オプショナル連鎖を通してAddressクラスのbuildingIdentifier()メソッドを呼び出します。

source: The example below categorizes an (x, y) point on the following graph:
ja: 下の例は、続くグラフ上でポイント(x, y)を分類します：

source: The example below creates a dictionary to store the names of international airports.
ja: 下の例は、国際空港の名前を格納するための辞書を作成します。

source: The example below creates a set called favoriteGenres to store String values:
ja: 以下の例は、favoriteGenresと呼ばれる集合をString値を格納するために作成します：

source: The example below creates an array called shoppingList to store String values:
ja: 下の例は、String値を格納するshoppingListと呼ばれる配列をつくります：

source: The example below defines a Vector3D structure for a three-dimensional position vector (x, y, z), similar to the Vector2D structure.
ja: 下の例は、Vector3D構造体を３次元の位置ベクトル(x, y, z)に対して定義します、Vector2D構造体に似たものです。

source: The example below defines a base class called Vehicle.
ja: 下の例は、Vehicleと呼ばれる基盤クラスを定義します。

source: The example below defines a class called Document.
ja: 下の例は、Documentと呼ばれるクラスを定義します。

source: The example below defines a custom Rect structure to represent a geometric rectangle.
ja: 下の例は、幾何学の長方形を表すためにあつらえのRect構造体を定義します。
